{
    "DO": "closed finalSummary",
    "XD": "closed warningDialogue",
    "SK": "skipped to next month", 
    "XR": "closed aiDialogue",
    "XA": "closed assesmentDialogue",
    "XL": "closed messageDialogue",
    "XF": "closed feedbackDialogue",
    "XT": "closed textDialogue",
    "XN": "closed newsScene",
    "XM": "closed managementDialogue",
    "XG": "closed marketDialogue",
    "XW": "closed workshopDialogue",
    "XS": "closed storageDialogue",
    "OS": "opened Markt",
    "O1": "opened Management 1",
    "O2": "opened Management 2",
    "RB": "looked up parts for Bett.",
    "RR": "looked up parts for Regal.",
    "RC": "looked up parts for Stuhl.",
    "RT": "looked up parts for Tisch.",
    "ST": "opened Lager",
    "OA": "opened Werkstatt A",
    "OB": "opened Werkstatt B",
    "OC": "opened Werkstatt C",
    "OD": "opened Werkstatt D",
    "TL": "clicked on produce button: Tischbein - success.",
    "TP": "clicked on produce button: Tischplatte - success.",
    "CB": "clicked on produce button: Stuhlbein - success.",
    "CK": "clicked on produce button: Lehne - success.",
    "BE": "clicked on produce button: Bettrahmen - success.",
    "BB": "clicked on produce button: Bettgestell - success.",
    "RF": "clicked on produce button: Regalrahmen - success.",
    "RP": "clicked on produce button: Regalbrett - success.",
    "WT": "failed to produce Tischbein. Reason: Nicht genug Holz!",
    "MT": "failed to produce Tischbein. Reason: Nicht genug Metall!",
    "AT": "failed to produce Tischbein. Reason: Keine Zeit mehr in A!",
    "BT": "failed to produce Tischbein. Reason: Keine Zeit mehr in B!",
    "CT": "failed to produce Tischbein. Reason: Keine Zeit mehr in C!",
    "DT": "failed to produce Tischbein. Reason: Keine Zeit mehr in D!",
    "WP": "failed to produce Tischplatte. Reason: Nicht genug Holz!",
    "MP": "failed to produce Tischplatte. Reason: Nicht genug Metall!",
    "AP": "failed to produce Tischplatte. Reason: Keine Zeit mehr in A!",
    "BP": "failed to produce Tischplatte. Reason: Keine Zeit mehr in B!",
    "CP": "failed to produce Tischplatte. Reason: Keine Zeit mehr in C!",
    "DP": "failed to produce Tischplatte. Reason: Keine Zeit mehr in D!",
    "WC": "failed to produce Stuhlbein. Reason: Nicht genug Holz!",
    "MC": "failed to produce Stuhlbein. Reason: Nicht genug Metall!",
    "AC": "failed to produce Stuhlbein. Reason: Keine Zeit mehr in A!",
    "BC": "failed to produce Stuhlbein. Reason: Keine Zeit mehr in B!",
    "CC": "failed to produce Stuhlbein. Reason: Keine Zeit mehr in C!",
    "DC": "failed to produce Stuhlbein. Reason: Keine Zeit mehr in D!",
    "WL": "failed to produce Lehne. Reason: Nicht genug Holz!",
    "ML": "failed to produce Lehne. Reason: Nicht genug Metall!",
    "AL": "failed to produce Lehne. Reason: Keine Zeit mehr in A!",
    "BL": "failed to produce Lehne. Reason: Keine Zeit mehr in B!",
    "CL": "failed to produce Lehne. Reason: Keine Zeit mehr in C!",
    "DL": "failed to produce Lehne. Reason: Keine Zeit mehr in D!",
    "WF": "failed to produce Bettrahmen. Reason: Nicht genug Holz!",
    "MF": "failed to produce Bettrahmen. Reason: Nicht genug Metall!",
    "AF": "failed to produce Bettrahmen. Reason: Keine Zeit mehr in A!",
    "BF": "failed to produce Bettrahmen. Reason: Keine Zeit mehr in B!",
    "CF": "failed to produce Bettrahmen. Reason: Keine Zeit mehr in C!",
    "DF": "failed to produce Bettrahmen. Reason: Keine Zeit mehr in D!",
    "WG": "failed to produce Bettgestell. Reason: Nicht genug Holz!",
    "MG": "failed to produce Bettgestell. Reason: Nicht genug Metall!",
    "AG": "failed to produce Bettgestell. Reason: Keine Zeit mehr in A!",
    "BG": "failed to produce Bettgestell. Reason: Keine Zeit mehr in B!",
    "CG": "failed to produce Bettgestell. Reason: Keine Zeit mehr in C!",
    "DG": "failed to produce Bettgestell. Reason: Keine Zeit mehr in D!",
    "WS": "failed to produce Regalrahmen. Reason: Nicht genug Holz!",
    "MS": "failed to produce Regalrahmen. Reason: Nicht genug Metall!",
    "AS": "failed to produce Regalrahmen. Reason: Keine Zeit mehr in A!",
    "BS": "failed to produce Regalrahmen. Reason: Keine Zeit mehr in B!",
    "CS": "failed to produce Regalrahmen. Reason: Keine Zeit mehr in C!",
    "DS": "failed to produce Regalrahmen. Reason: Keine Zeit mehr in D!",
    "WR": "failed to produce Regalbrett. Reason: Nicht genug Holz!",
    "MR": "failed to produce Regalbrett. Reason: Nicht genug Metall!",
    "AR": "failed to produce Regalbrett. Reason: Keine Zeit mehr in A!",
    "BR": "failed to produce Regalbrett. Reason: Keine Zeit mehr in B!",
    "CR": "failed to produce Regalbrett. Reason: Keine Zeit mehr in C!",
    "DR": "failed to produce Regalbrett. Reason: Keine Zeit mehr in D!",
    "SM": "sound muted",
    "SA": "sound activated"
}